WSDL/OpenShipService/OpenShip_v15/ModifyPackageInOpenShipment_WARNING_794906627579_OK.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v15="http://fedex.com/ws/openship/v15">
   <soapenv:Header/>
   <soapenv:Body>
      <v15:ModifyPackageInOpenShipmentRequest>
          <v15:WebAuthenticationDetail>
            <v15:ParentCredential>
               <v15:Key>INPUT YOUR INFORMATION</v15:Key>
               <v15:Password>INPUT YOUR INFORMATION</v15:Password>
            </v15:ParentCredential>
            <v15:UserCredential>
               <v15:Key>INPUT YOUR INFORMATION</v15:Key>
               <v15:Password>INPUT YOUR INFORMATION</v15:Password>
            </v15:UserCredential>
         </v15:WebAuthenticationDetail>
         <v15:ClientDetail>
            <v15:AccountNumber>INPUT YOUR INFORMATION</v15:AccountNumber>
            <v15:MeterNumber>INPUT YOUR INFORMATION</v15:MeterNumber>
            <v15:Localization>
               <v15:LanguageCode>EN</v15:LanguageCode>
               <v15:LocaleCode>en</v15:LocaleCode>
            </v15:Localization>
         </v15:ClientDetail>
         <v15:TransactionDetail>
            <v15:CustomerTransactionId>ModifyPackageInOpenShipmentRequest_v15</v15:CustomerTransactionId>
            <v15:Localization>
               <v15:LanguageCode>EN</v15:LanguageCode>
               <v15:LocaleCode>en</v15:LocaleCode>
            </v15:Localization>
         </v15:TransactionDetail>
         <v15:Version>
            <v15:ServiceId>ship</v15:ServiceId>
            <v15:Major>15</v15:Major>
            <v15:Intermediate>0</v15:Intermediate>
            <v15:Minor>0</v15:Minor>
         </v15:Version>
         <v15:Index>Key3180</v15:Index>
         <v15:TrackingId>
            <v15:TrackingNumber>794906627579</v15:TrackingNumber>
         </v15:TrackingId>
         <v15:RequestedPackageLineItem>
            <v15:SequenceNumber>1</v15:SequenceNumber>
            <v15:VariableHandlingChargeDetail>
               <v15:FixedValue>
                  <v15:Currency>USD</v15:Currency>
                  <v15:Amount>121</v15:Amount>
               </v15:FixedValue>
               <v15:PercentValue>1</v15:PercentValue>
               <v15:RateElementBasis>BASE_CHARGE</v15:RateElementBasis>
               <v15:RateTypeBasis>ACCOUNT</v15:RateTypeBasis>
            </v15:VariableHandlingChargeDetail>
            <v15:InsuredValue>
               <v15:Currency>USD</v15:Currency>
               <v15:Amount>100.00</v15:Amount>
            </v15:InsuredValue>
            <v15:Weight>
               <v15:Units>LB</v15:Units>
               <v15:Value>20.00</v15:Value>
            </v15:Weight>
            <v15:Dimensions>
               <v15:Length>108</v15:Length>
               <v15:Width>5</v15:Width>
               <v15:Height>5</v15:Height>
               <v15:Units>IN</v15:Units>
            </v15:Dimensions>
            <v15:ContentRecords>
               <v15:PartNumber>121</v15:PartNumber>
               <v15:ItemNumber>1</v15:ItemNumber>
               <v15:ReceivedQuantity>10</v15:ReceivedQuantity>
               <v15:Description>111</v15:Description>
            </v15:ContentRecords>
         </v15:RequestedPackageLineItem>
      </v15:ModifyPackageInOpenShipmentRequest>
   </soapenv:Body>
</soapenv:Envelope>


Response:

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
   <SOAP-ENV:Header/>
   <SOAP-ENV:Body>
      <ModifyPackageInOpenShipmentReply xmlns="http://fedex.com/ws/openship/v15">
         <HighestSeverity>WARNING</HighestSeverity>
         <Notifications>
            <Severity>WARNING</Severity>
            <Source>ship</Source>
            <Code>2469</Code>
            <Message>shipTimestamp is invalid</Message>
            <LocalizedMessage>shipTimestamp is invalid</LocalizedMessage>
         </Notifications>
         <TransactionDetail>
            <CustomerTransactionId>ModifyPackageInOpenShipmentRequest_v15</CustomerTransactionId>
            <Localization>
               <LanguageCode>EN</LanguageCode>
               <LocaleCode>en</LocaleCode>
            </Localization>
         </TransactionDetail>
         <Version>
            <ServiceId>ship</ServiceId>
            <Major>15</Major>
            <Intermediate>0</Intermediate>
            <Minor>0</Minor>
         </Version>
         <JobId>3f0e20a5631717s025cej221356</JobId>
         <CompletedShipmentDetail>
            <UsDomestic>false</UsDomestic>
            <CarrierCode>FDXE</CarrierCode>
            <MasterTrackingId>
               <TrackingIdType>FEDEX</TrackingIdType>
               <FormId>0430</FormId>
               <TrackingNumber>794906627579</TrackingNumber>
            </MasterTrackingId>
            <CompletedPackageDetails>
               <SequenceNumber>1</SequenceNumber>
               <TrackingIds>
                  <TrackingIdType>FEDEX</TrackingIdType>
                  <FormId>0430</FormId>
                  <TrackingNumber>794906627579</TrackingNumber>
               </TrackingIds>
               <GroupNumber>0</GroupNumber>
            </CompletedPackageDetails>
            <CompletedPackageDetails>
               <SequenceNumber>2</SequenceNumber>
               <TrackingIds>
                  <TrackingIdType>FEDEX</TrackingIdType>
                  <FormId>0441</FormId>
                  <TrackingNumber>794906627580</TrackingNumber>
               </TrackingIds>
               <GroupNumber>0</GroupNumber>
            </CompletedPackageDetails>
            <CompletedPackageDetails>
               <SequenceNumber>3</SequenceNumber>
               <TrackingIds>
                  <TrackingIdType>FEDEX</TrackingIdType>
                  <FormId>0441</FormId>
                  <TrackingNumber>794906627590</TrackingNumber>
               </TrackingIds>
               <GroupNumber>0</GroupNumber>
            </CompletedPackageDetails>
            <CompletedPackageDetails>
               <SequenceNumber>4</SequenceNumber>
               <TrackingIds>
                  <TrackingIdType>FEDEX</TrackingIdType>
                  <FormId>0441</FormId>
                  <TrackingNumber>794906627605</TrackingNumber>
               </TrackingIds>
               <GroupNumber>0</GroupNumber>
            </CompletedPackageDetails>
            <CompletedPackageDetails>
               <SequenceNumber>5</SequenceNumber>
               <TrackingIds>
                  <TrackingIdType>FEDEX</TrackingIdType>
                  <FormId>0441</FormId>
                  <TrackingNumber>794906627616</TrackingNumber>
               </TrackingIds>
               <GroupNumber>0</GroupNumber>
            </CompletedPackageDetails>
            <CompletedPackageDetails>
               <SequenceNumber>6</SequenceNumber>
               <TrackingIds>
                  <TrackingIdType>FEDEX</TrackingIdType>
                  <FormId>0441</FormId>
                  <TrackingNumber>794906638186</TrackingNumber>
               </TrackingIds>
               <GroupNumber>1</GroupNumber>
            </CompletedPackageDetails>
         </CompletedShipmentDetail>
      </ModifyPackageInOpenShipmentReply>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>


Additional Info:
URL:https://wsdrt.idev.fedex.com:443/web-services
Date:Wed Nov 29 11:27:22 IST 2017
TimeTaken:2214ms
